---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.ShowHistory
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.ShowHistory

Displays a list of all the times a workshared file (the central model or a local copy of the central model) was saved and who saved it.